==========================================
(ROUTER-1)
==========================================
Router>en
Router#conf t
Router(config)#hostname main
main(config)#!Interface-UP-process---------
main(config)#interface gigabitEthernet 0/0
main(config-if)#ip address 192.168.1.1 255.255.255.0
main(config-if)#no sh

main(config-if)#interface gigabitEthernet 0/1
main(config-if)#ip address 20.20.20.1 255.255.255.252
main(config-if)#no sh
==========================================================================================
main(config)#!DHCP-Exclude-process---------
main(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.50
main(config)#ip dhcp excluded-address 192.168.2.1 192.168.2.50
main(config)#ip dhcp excluded-address 192.168.3.1 192.168.3.50
--------------------------
main(config)#!DHCP-Pool-create---------
main(config)#ip dhcp pool IT
main(dhcp-config)#network 192.168.1.0 255.255.255.0
main(dhcp-config)#default-router 192.168.1.1
main(dhcp-config)#dns-server 8.8.8.8
main(dhcp-config)#exit

main(config)#ip dhcp pool HR
main(dhcp-config)#network 192.168.2.0 255.255.255.0
main(dhcp-config)#default-router 192.168.2.1
main(dhcp-config)#dns-server 8.8.8.8
main(dhcp-config)#exit

main(config)#ip dhcp pool Sales
main(dhcp-config)#network 192.168.3.0 255.255.255.0
main(dhcp-config)#default-router 192.168.2.1
main(dhcp-config)#dns-server 8.8.8.8
main(dhcp-config)#exit
==========================================================================================
main(config)#!Static-Route-process---------
main(config)#ip route 192.168.2.0 255.255.255.0 gigabitEthernet 0/1
main(config)#ip route 192.168.3.0 255.255.255.0 gigabitEthernet 0/1
main(config)#ip route 30.30.30.0 255.255.255.252 gigabitEthernet 0/1
sh ip route 
     20.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       20.20.20.0/30 is directly connected, GigabitEthernet0/1
L       20.20.20.1/32 is directly connected, GigabitEthernet0/1
     30.0.0.0/30 is subnetted, 1 subnets
S       30.30.30.0/30 is directly connected, GigabitEthernet0/1
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0
L       192.168.1.1/32 is directly connected, GigabitEthernet0/0
S    192.168.2.0/24 is directly connected, GigabitEthernet0/1
S    192.168.3.0/24 is directly connected, GigabitEthernet0/1
=======================================================================================

=======================================================================================
(ROUTER-2)
=================================
Router(config)#hostname HR
HR(config)#int g 0/1
HR(config-if)#ip add
HR(config-if)#ip address 20.20.20.2 255.255.255.252
HR(config-if)#no sh

HR(config-if)#int g 0/2
HR(config-if)#ip address 30.30.30.2 255.255.255.252
HR(config-if)#no sh

HR(config-if)#int g 0/0
HR(config-if)#ip address 192.168.2.1 255.255.255.0
HR(config-if)#no sh

HR(config)#ip route 192.168.1.0 255.255.255.0 g 0/1

HR(config)#ip route 30.30.30.0 255.255.255.252 g 0/2
==============================================================================
HR(config)#!DHCP-Relay-configuration in Router 2 for to get ip from HR pool
HR(config)#int g 0/0
HR(config-if)#ip help
HR(config-if)#ip helper-address 20.20.20.1
HR(config-if)#exit
=======================================================================================

=======================================================================================
(ROUTER-3)
=================================

Router>en
Router#conf t
Router(config)#host
Router(config)#hostname Sales

Sales(config-if)#int g 0/0	
Sales(config-if)#ip add 192.168.3.1 255.255.255.0
Sales(config-if)#no sh

Sales(config-if)#int g 0/1
Sales(config-if)#ip add 30.30.30.1 255.255.255.252
Sales(config-if)#no sh

Sales(config)#ip route 20.20.20.0 255.255.255.252 g 0/1

Sales(config)#ip route 192.168.1.0 255.255.255.0 g 0/1

Sales(config)#ip route 192.168.2.0 255.255.255.0 g 0/1
-----------------------------------------------------------------------------------------
HR(config)#!DHCP-Relay-configuration in Router 2 for to get ip from Sales pool in router 1
Sales(config)#int g 0/0
Sales(config-if)#ip helper-address 20.20.20.1
Sales(config-if)#ip helper-address 30.30.30.1
--------------------------------------------------------------------------------------------





