System Bootstrap, Version 15.1(4)M4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 2010 by cisco Systems, Inc.
Total memory size = 512 MB - On-board = 512 MB, DIMM0 = 0 MB
CISCO2911/K9 platform with 524288 Kbytes of main memory
Main memory is configured to 72/-1(On-board/DIMM0) bit mode with ECC disabled

Readonly ROMMON initialized

program load complete, entry point: 0x80803000, size: 0x1b340
program load complete, entry point: 0x80803000, size: 0x1b340

IOS Image Load Test
___________________
Digitally Signed Release Software
program load complete, entry point: 0x81000000, size: 0x3bcd3d8
Self decompressing the image :
########################################################################## [OK]
Smart Init is enabled
smart init is sizing iomem
                  TYPE      MEMORY_REQ
     Onboard devices &
          buffer pools      0x022F6000
-----------------------------------------------
                TOTAL:      0x022F6000
Rounded IOMEM up to: 36Mb.
Using 6 percent iomem. [36Mb/512Mb]

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706

Cisco IOS Software, C2900 Software (C2900-UNIVERSALK9-M), Version 15.1(4)M5, RELEASE SOFTWARE (fc2)Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 18-Jul-07 04:52 by pt_team
Image text-base: 0x2100F918, data-base: 0x24729040

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco CISCO2911/K9 (revision 1.0) with 491520K/32768K bytes of memory.
Processor board ID FTX152400KS
3 Gigabit Ethernet interfaces
DRAM configuration is 64 bits wide with parity disabled.
255K bytes of non-volatile configuration memory.
249856K bytes of ATA System CompactFlash 0 (Read/Write)


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: 

Press RETURN to get started!



Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip address 13.13.13.2 255.0.0.0
Router(config-if)#ip address 13.13.13.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Router(config-if)#exit
Router(config)#interface GigabitEthernet0/2
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#

:::::::::::::Static NAT Configuration:::::::::::::::::::::::::
Router(config)#!Static NAT configutation
Router(config)#ip nat inside source static tcp 192.168.1.10 123 10.10.10.1 123
Router(config)#ip nat inside source static tcp 192.168.1.10 321 10.10.10.2 321
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::DHCP Configuration:::::::::::::::::::::::::
Router(config)#!Exclude ip address
Router(config)#ip dh
Router(config)#ip dhcp ex
Router(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.50
Router(config)#ip dhcp excluded-address 192.168.1.101 192.168.1.255
Router(config)#ip dhcp excluded-address 192.168.2.1 192.168.2.50
Router(config)#ip dhcp excluded-address 192.168.2.101 192.168.2.255
-------------------------------------
Router(config)#!Create DHCP
Router(config)#ip dhcp pool LAN_1
Router(dhcp-config)#ne
Router(dhcp-config)#network 192.168.1.0 255.255.255.0
Router(dhcp-config)#de
Router(dhcp-config)#default-router 192.168.1.1
Router(dhcp-config)#dns
Router(dhcp-config)#dns-server 8.8.8.8

Router(config)#ip dhcp pool LAN_2
Router(dhcp-config)#network 192.168.2.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.2.1
Router(dhcp-config)#dns-server 8.8.8.8
Router(dhcp-config)#exit
--------------------------------------------
Router(config)#!Default Route
Router(config)#ip route 0.0.0.0 0.0.0.0 gigabitEthernet 0/0

Router(config)#do ping 11.11.11.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 11.11.11.2, timeout is 2 seconds:
..!!!
Success rate is 60 percent (3/5), round-trip min/avg/max = 0/0/0 ms
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::::::::::::::::::::::::::PAT::::::::::::::::::::::::::::::::::::::::::::::::
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#!Indentify Inside and Outside port
Router(config-if)#ip nat inside 
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/2
Router(config-if)#ip nat inside 
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip nat outside 
Router(config-if)#exit
----------------------------------------------------------
Router(config-if)#!Apply Standard ACL as we don't know destination 
Router(config)#!access list name PAT
Router(config)#ip access-list standard PAT
Router(config-std-nacl)#permit 192.168.1.0 0.0.0.255
Router(config-std-nacl)#permit 192.168.2.0 0.0.0.255
Router(config-std-nacl)#exit
------------------------------------------------------------------------------------
Router(config-if)#!Apply PAT in name based Standard ACL"PAT"
Router(config)#ip nat inside source list PAT interface gigabitEthernet 0/0 overload 
-------------------------------------------------------------------------------------
